//1
//#include <iostream>
//using namespace std;
//int main()
//
//{
//int x = 10;
//int y = 5;
//int* px;
//int* py;
//// Записуємо адресу змінної x у px
//px = &x;
//// Відображаємо адресу x через покажчик
//// та операцію взяття адреси
//cout << px << " " << &x << endl;
//// Відображаємо значення x через змінну
//// й операцію розіменування
//// на екрані 10 10
//cout << *px << " " << x << endl;
//// Змінюємо значення змінної x
//// використовуємо операцію розіменування
//*px = 99;
///* Відображаємо нове значення x через змінну
//й операцію розіменування
//на екрані відобразиться 99 99
//*/
//cout << *px << " " << x << endl << endl;
//// Записуємо адресу змінної y в py
//py = &y;
//// Відображаємо адресу y через покажчик
//// та операцію взяття адреси
//cout << py << " " << &y << endl;
//// Відображаємо значення y через змінну
//// й операцію розіменування на екрані 5 5
//cout << *py << " " << y << endl;
//// записуємо значення адреси з px у py
//// тепер обидва покажчики вказують на x
//py = px;
//// Відображаємо значення x через змінну
//// і два покажчики на екрані 99 99 99
//cout << *px << " " << *py << " " << x << endl << endl;
//return 0;
//}

//#include <iostream>
//using namespace std;
//int main()
//{
//	const int size = 5;
//	int arr[size] = { 33, 44, 7, 8, 9 };
//	/* записуємо адресу нульового елемента масиву
//	в покажчик */
//	int* ptr = &arr[0];
//	/*
//	Показуємо значення нульового елемента масиву
//	через розіменування покажчика.
//	На екрані 33
//	*/
//	cout << *ptr << endl;
//		/*
//		Показуємо значення першого елемента масиву
//		через розіменування покажчика.
//		Ми додаємо зсув за адресою на один елемент
//		після чого виконуємо розіменування.
//		Адреса всередині покажчика не змінюється.
//		На екрані 44
//		*/
//		cout << *(ptr + 1) << endl;
//	/*
//	Виконуємо зсув на один елемент цілого типу
//	вперед і записуємо нову адресу в покажчик ptr.
//	Фактично ця операція виглядає так
//	ptr = ptr + 1 * sizeof(int)
//	Тепер у покажчику міститься адреса першого
//	елемента. Можна було також написати ptr++;
//	*/
//	ptr = ptr + 1;
//	/*
//	Показуємо значення першого елемента масиву
//	через розіменування покажчика.
//	На екрані 44
//	*/
//	cout << *ptr << endl;
//	return 0;
//}

//#include <iostream>
//using namespace std;
//void ShowArray(int arr[], int size) {
//	for (int i = 0; i < size; i++) {
//		cout << *(arr + i) << " ";
//	}
//}
//// обчислення суми елементів масиву
//int GetAmount(int* ptr, int size) {
//	int sum = 0;
//	for (int i = 0; i < size; i++) {
//		sum += *(ptr + i);
//	}
//	return sum;
//}
//int main()
//{
//	const int size = 5;
//	int arr[size] = { 33, 44, 7, 8, 9 };
//	// відображаємо весь масив на екрані 33 44 7 8 9
//	ShowArray(arr, size);
//	cout << endl << endl;
//	// показуємо суму елементів масиву
//	// 101
//	cout << "Amount of array elements: " <<
//		GetAmount(arr, size) << endl << endl;
//	/* відображаємо весь масив на екрані
//	33 44 7 8 9
//	*/
//	ShowArray(&arr[0], size);
//	return 0;
//}

//5

//#include<iostream>
//#include<stdlib.h>
//using namespace std;
//
//int main()
//{
//	int a = 2, b = 3, c = 4;
//	float d = 8.5;
//
//	int* ptr1 = &a; int* ptr2 = &b; //не можна задавати одразу(?)
//	float* x, y = 3.5;	
//	float* ptr; //не можна через void буде змінювати данні
//
//	cout << " Enter b = " << endl;
//	//cin >> ptr2; не можна вводити адресу
//	cin >> b;
//	cout << "ptr1 = " << ptr1 << "\t *ptr1 = " << *ptr1 << "\tptr2 =  " << ptr2 /*ptr1*/ << "\t *ptr2 =  " << *ptr2 << endl;
//
//	*ptr2 = *(ptr2 + 1);/* *(ptr2 + 1) = 15;  ??? не зовсім зрозумів що це робить, але тепер b= якийсь мусор з ОП */
//	cout << "a = " << a << "\tb = " << b << "\tc = " << c << endl;
//
//	x = &y;
//	cout << "x = " << x << "\t*x = " << *x << "\ty = " << y << endl;
//
//	ptr = x;
//	*ptr = 45;
//	cout << "ptr = " << ptr << "\t*ptr =  " << *ptr << "\tx =  " << x << "\t*x = " << *x << "\ty =  " << y << endl;
//
//
//	return 0;
//
//}

//6

#include <iostream>
using namespace std;

int main() {
	const int size = 10;
	int a[size]{45,-84,1,5,8,35,0,76,-23,90};
	int* viewer = a;
	int* ptr = a;
	int temp = a[size-1]; //вирішення проблеми зміни темпу через арифметку покажчиків(?)
	for (int i = 0; i < size; i++) {
		cout << *viewer << " ";
		viewer++;
	}
	int* ptrtemp = &temp; //вирішення проблеми зміни темпу через арифметку покажчиків(?) 
	cout << endl;
	a[size - 1] = *ptr;
	a[0] = *ptrtemp;

	viewer = a;
	for (int i = 0; i < size; i++) {
		cout << *viewer << " ";
		viewer++;
	}
}
